## Final Project Submission

Please fill out:
* Student name: 
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

In [65]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [66]:
df = pd.read_csv('kc_house_data.csv')
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,10/13/2014,221900.0,3,1.00,1180,5650,1.0,NaN,0.0,...,7,1180,0.0,1955,0.0,98178,47.5112,-122.257,1340,5650
1,6414100192,12/9/2014,538000.0,3,2.25,2570,7242,2.0,0.0,0.0,...,7,2170,400.0,1951,1991.0,98125,47.7210,-122.319,1690,7639
2,5631500400,2/25/2015,180000.0,2,1.00,770,10000,1.0,0.0,0.0,...,6,770,0.0,1933,NaN,98028,47.7379,-122.233,2720,8062
3,2487200875,12/9/2014,604000.0,4,3.00,1960,5000,1.0,0.0,0.0,...,7,1050,910.0,1965,0.0,98136,47.5208,-122.393,1360,5000
4,1954400510,2/18/2015,510000.0,3,2.00,1680,8080,1.0,0.0,0.0,...,8,1680,0.0,1987,0.0,98074,47.6168,-122.045,1800,7503

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21597 entries, 0 to 21596
Data columns (total 21 columns):
id               21597 non-null int64
date             21597 non-null object
price            21597 non-null float64
bedrooms         21597 non-null int64
bathrooms        21597 non-null float64
sqft_living      21597 non-null int64
sqft_lot         21597 non-null int64
floors           21597 non-null float64
waterfront       19221 non-null float64
view             21534 non-null float64
condition        21597 non-null int64
grade            21597 non-null int64
sqft_above       21597 non-null int64
sqft_basement    21597 non-null object
yr_built         21597 non-null int64
yr_renovated     17755 non-null float64
zipcode          21597 non-null int64
lat              21597 non-null float64
long             21597 non-null float64
sqft_living15    21597 non-null int64
sqft_lot15       21597 non-null int64
dtypes: float64(8), int64(11), object(2)
memory usage: 3.5+ MB

In [74]:
def data_check(dataframe):
    for col in dataframe.columns:
        dashes = '-----'
        print(dashes*13)
        print(dataframe[col].name)
        if dataframe[col].isna().sum() >0:
            print(f'Numbers of NaNs: {dataframe[col].isna().sum()}\n')
        print(f'Most Common Values:\n{dataframe[col].value_counts()}\n\n')
        
# df.isna().sum()
# df.yr_renovated.value_counts()

In [75]:
data_check(df)

-----------------------------------------------------------------
id
Most Common Values:
2911700010    1
5450300010    1
5104511600    1
1160000115    1
686530110     1
             ..
2115510470    1
2922701305    1
6071600370    1
526059224     1
1777500160    1
Name: id, Length: 21420, dtype: int64


-----------------------------------------------------------------
date
Most Common Values:
6/23/2014     142
6/25/2014     131
6/26/2014     131
7/8/2014      127
4/27/2015     126
             ...
7/27/2014       1
11/30/2014      1
8/3/2014        1
2/15/2015       1
8/30/2014       1
Name: date, Length: 372, dtype: int64


-----------------------------------------------------------------
price
Most Common Values:
350000.0    172
450000.0    171
550000.0    156
500000.0    151
425000.0    150
           ...
804995.0      1
870515.0      1
336950.0      1
386100.0      1
884744.0      1
Name: price, Length: 3607, dtype: int64


-----------------------------------------------------------------
bedrooms
Most Common Values:
3     9731
4     6849
2     2736
5     1586
6      265
1      191
7       38
8       13
9        6
10       3
11       1
33       1
Name: bedrooms, dtype: int64


-----------------------------------------------------------------
bathrooms
Most Common Values:
2.50    5352
1.00    3794
1.75    3020
2.25    2031
2.00    1913
1.50    1429
2.75    1182
3.00     747
3.50     729
3.25     586
3.75     155
4.00     134
4.50      99
4.25      79
0.75      70
4.75      23
5.00      21
5.25      13
5.50      10
1.25       9
6.00       6
5.75       4
0.50       4
8.00       2
6.25       2
6.75       2
6.50       2
7.50       1
7.75       1
Name: bathrooms, dtype: int64


-----------------------------------------------------------------
sqft_living
Most Common Values:
1300    136
1440    133
1400    132
1660    128
1800    128
       ...
4970      1
2905      1
2793      1
4810      1
1975      1
Name: sqft_living, Length: 1034, dtype: int64


-----------------------------------------------------------------
sqft_lot
Most Common Values:
5000      355
6000      286
4000      249
7200      218
7500      118
         ...
9133        1
64438       1
953         1
969         1
315374      1
Name: sqft_lot, Length: 9776, dtype: int64


-----------------------------------------------------------------
floors
Most Common Values:
1.0    10552
2.0     8203
1.5     1888
3.0      609
2.5      161
3.5        7
Name: floors, dtype: int64


-----------------------------------------------------------------
waterfront
Numbers of NaNs: 2353

Most Common Values:
0.0    18921
1.0      146
Name: waterfront, dtype: int64


-----------------------------------------------------------------
view
Numbers of NaNs: 63

Most Common Values:
0.0    19253
2.0      956
3.0      505
1.0      329
4.0      314
Name: view, dtype: int64


-----------------------------------------------------------------
condition
Most Common Values:
3    13900
4     5643
5     1687
2      162
1       28
Name: condition, dtype: int64


-----------------------------------------------------------------
grade
Most Common Values:
7     8889
8     6041
9     2606
6     1995
10    1130
11     396
5      234
12      88
4       27
13      13
3        1
Name: grade, dtype: int64


-----------------------------------------------------------------
sqft_above
Most Common Values:
1300    210
1010    204
1200    203
1220    186
1140    183
       ...
2665      1
2601      1
440       1
2473      1
1975      1
Name: sqft_above, Length: 942, dtype: int64


-----------------------------------------------------------------
sqft_basement
Most Common Values:
0.0       12717
?           452
600.0       216
500.0       206
700.0       205
          ...
2196.0        1
875.0         1
225.0         1
248.0         1
518.0         1
Name: sqft_basement, Length: 304, dtype: int64


-----------------------------------------------------------------
yr_built
Most Common Values:
2014    559
2006    453
2005    450
2004    429
2003    420
       ...
1901     29
1933     29
1902     27
1935     24
1934     21
Name: yr_built, Length: 116, dtype: int64


-----------------------------------------------------------------
yr_renovated
Numbers of NaNs: 3804

Most Common Values:
0.0       16876
2014.0       73
2003.0       31
2013.0       31
2007.0       30
          ...
1934.0        1
1971.0        1
1954.0        1
1950.0        1
1944.0        1
Name: yr_renovated, Length: 70, dtype: int64


-----------------------------------------------------------------
zipcode
Most Common Values:
98103    600
98038    586
98115    576
98052    571
98117    548
        ...
98102    104
98010     99
98024     79
98148     56
98039     49
Name: zipcode, Length: 70, dtype: int64


-----------------------------------------------------------------
lat
Most Common Values:
47.6624    17
47.5322    17
47.5491    17
47.6846    17
47.6711    16
           ..
47.7491     1
47.6552     1
47.3976     1
47.5988     1
47.2715     1
Name: lat, Length: 5033, dtype: int64


-----------------------------------------------------------------
long
Most Common Values:
-122.290    113
-122.300    110
-122.362    102
-122.291    100
-122.363     99
           ...
-122.467      1
-121.403      1
-121.804      1
-121.726      1
-121.893      1
Name: long, Length: 751, dtype: int64


-----------------------------------------------------------------
sqft_living15
Most Common Values:
1540    193
1560    190
1440    190
1500    178
1460    168
       ...
4890      1
2873      1
952       1
3193      1
2049      1
Name: sqft_living15, Length: 777, dtype: int64


-----------------------------------------------------------------
sqft_lot15
Most Common Values:
5000     425
4000     354
6000     285
7200     209
4800     144
        ...
11068      1
21315      1
35656      1
13135      1
6147       1
Name: sqft_lot15, Length: 8682, dtype: int64

**Here 'id' has no NaN's but I must take care of duplicate id's by dropping them. ID's should be the unique identifier for each home**

In [72]:
df.drop_duplicates(subset='id',inplace=True)

**Here I am changing date into date format**

In [76]:
pd.to_datetime(df.date)

0       2014-10-13
1       2014-12-09
2       2015-02-25
3       2014-12-09
4       2015-02-18
           ...
21592   2014-05-21
21593   2015-02-23
21594   2014-06-23
21595   2015-01-16
21596   2014-10-15
Name: date, Length: 21420, dtype: datetime64[ns]

In [26]:
display(df[df['yr_renovated'] > 0.0]['yr_renovated'].describe())
df[df['yr_renovated'] > 0.0]['yr_renovated'].hist();

count     744.000000
mean     1995.928763
std        15.599946
min      1934.000000
25%      1987.000000
50%      2000.000000
75%      2007.250000
max      2015.000000
Name: yr_renovated, dtype: float64

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,10/13/2014,221900.0,3,1.00,1180,5650,1.0,NaN,0.0,...,7,1180,0.0,1955,0.0,98178,47.5112,-122.257,1340,5650
3,2487200875,12/9/2014,604000.0,4,3.00,1960,5000,1.0,0.0,0.0,...,7,1050,910.0,1965,0.0,98136,47.5208,-122.393,1360,5000
4,1954400510,2/18/2015,510000.0,3,2.00,1680,8080,1.0,0.0,0.0,...,8,1680,0.0,1987,0.0,98074,47.6168,-122.045,1800,7503
5,7237550310,5/12/2014,1230000.0,4,4.50,5420,101930,1.0,0.0,0.0,...,11,3890,1530.0,2001,0.0,98053,47.6561,-122.005,4760,101930
6,1321400060,6/27/2014,257500.0,3,2.25,1715,6819,2.0,0.0,0.0,...,7,1715,?,1995,0.0,98003,47.3097,-122.327,2238,6819

In [54]:
df.yr_renovated.fillna(0.0).astype('int')

0           0
1        1991
2           0
3           0
4           0
         ...
21592       0
21593       0
21594       0
21595       0
21596       0
Name: yr_renovated, Length: 21597, dtype: int32